{"thing": {"befolking": "A slang term used to describe the act of \"picking one's nose.\"", "adjoress": "A female teacher for whom the word \"adore\" was invented; one who is adored.", "berictions": "A battle cry in the Middle Ages.", "custacin": "The way the ancient Roman's achieved their high-sounding names for their offspring: the father's first name plus the word \"custos\" (keeper).\n", "strustate": "The act of looking depressed and not doing anything about it.", "dicapayroling": "A type of prosthesis used by the blind to read Braille by touch.", "peartzle": "The zipper of a T-shirt.", "skizzle": "A final note in a musical scale in the higher registers.", "astrus": "A genus of wrasse that is noted for the very large scales that adorn their bodies. Common in the Indo-pacific.", "orousloth": "Portmanteau of \"orchid\" and \"rhythm\" (referring to a type of bicycle that is ridden in an orchid-like, swaying motion).", "payellards": "To exchange and trade without giving anything in return.", "suspokertell": "The Scottish profession of a man who \"is always to be found with a glass of whiskey in one hand and a card in the other\".", "beaspieching": "The act of taking an animal's spleen as a delicacy.", "sloutly": "Sloutly can refer to any thing being \"sloppy\". Sloutly is a new word that only appeared in the late 1990s. It is most often used in texting applications.", "babones": "Spanish for \"pantyhose\".", "mustanslidly": "Pronounced \"mustin-slid-lai\", the word is used in the British Army to describe a soldier who is \"not quite right in the head\" or \"awkward\".", "forminsting": "A cottage cheese made by folding a slice of bread in half, cutting it lengthwise, then cutting it into cubes and adding them to the cottage cheese.", "totanded": "A verb describing the act of someone giving up, especially in sports.", "ponessing": "the act of a person who has taken a liking to one thing and has it in every aspect of their life.", "poemess": "A poem that has been obtusely adapted by a popular video game. The most common adaptation of this poem is in the game \"Dead Or Alive 4\"."}, "person": {"Bridgette Fitzpatrick": "The recipient of Australia’s third-highest civilian award, this Australian-born, U.S. citizen is the world’s only telephone call-in beauty pageant winner.", "Virginia Miller": "This highly successful American writer of children's books created the \"real woman\" in her romantic comedies and mysteries.", "Herbert Tucker": "The male protagonist of the classic children's book \"The Story of the Three Little Pigs\" by L. Frank Baum was a businessman who worked in the lumber industry.", "Lynette Santos": "The well-respected American public school teacher and longtime English teacher at her alma mater Carlisle Indian School is credited with saving the lives of several students by using a local wildfire to create an art project to teach them the value of fire.", "Lance Gallagher": "The most successful Cajun seafood entrepreneur of the 20th century was credited with inventing the gumbo recipe that became the cornerstone of New Orleans' culinary heritage.", "Fanny Ortega": "The prominent Mexican American feminist is the namesake of the Fanny Mae.", "Cornelius Anthony": "The co-founder of the modern American football in 1876, who is credited as the inventor of the forward pass.", "Amado Hancock": "The drag queen who was the inspiration for the character of Mimi in the play, \"La Cage aux Folles,\" was the inspiration for the character of the comic book superhero, Baily O'Brien.", "Carmen Boone": "As a hired gun, Carmen Boone was one of the few who, in the Wild West of the 1860s, knew how to take care of business, despite the foppish nature of the era.", "Wesley Hickman": "The renowned British astronomer who was credited with discovering the planet Neptune in 1846, using a telescope he built himself, was not even in his 20s when he discovered the planet.", "Foster Frank": "The American inventor of the standard 12-volt electrical system for automobile, airplane, and other vehicles had his patented system stolen by an unscrupulous businessman.", "Tamara Cobb": "The famous American cookbook author who later became a food critic for \"The New York Times\" is known for her low-fat, low-calorie recipes. She is credited with popularizing the green tea diet and the low-carb diet.", "Melissa Maldonado": "The owner of the largest collection of original and rare Elvis memorabilia, Melissa Maldonado can be credited with diligently documenting the life of Elvis Presley.", "Salvador Flynn": "The legendary New York City bartender who became so well known that he actually had a drink named after him, the Old Flynn.", "Carlo Hamilton": "This British industrialist behind the invention of the biodegradable plastic made the packaging for disposable nappies so unsanitary, it was banned by the London Board of Health in 1788.", "Julio Mcgrath": "The first recorded person to make a sandwich, his creations of cheese, meat, and bread-wrapped morsels are still as popular today as they were when he lived them.", "Shelly Hurley": "The Mother of the Boarding Schools in South Australia, this busybody activist is the namesake of the current Women’s and Children’s Hospital.", "Ulysses Duncan": "This American inventor is said to have created the world's first driving school in 1831.", "Randolph Durham": "The man who journeyed to the Yukon in search of gold, was frostbitten to the point where he was unable to speak for around a year, and still sought out gold in the Canadian wilderness, is a subject of the 2006 film \"The Way Back\" directed by Peter Weir.", "Aileen Freeman": "This Australian-born female coal miner made wireless radio a reality for the world in 1923, when she proved that you could bounce radio waves off objects without line of sight (direct line of sight was required for radio signals to travel)."}, "movie": {"Routine Exam": "When a nervous and untested nurse (Judy Davis) gets caught in a power outage at the hospital, she fears her life is going to fall apart, but eventually learns to console herself with the knowledge that she's just a nurse and has a routine exam next.", "In The Shadows": "A family of secret ninja warriors have to keep their skills secret even from their own children after their clan is targeted by an evil clan of ruthless ninjas.", "Status Update": "A dark satire on the superficial nature of social media, this film stars Sam Rockwell as an anonymous blogger who decides to throw in the towel after years of anonymous stalking.", "Lost Letter": "A runaway train and a lost love give birth to this heartwarming family comedy that mixes farce, action, comedy and tragedy, it's an original silent film never before released on DVD.", "Morning Sunrise": "When the end of the world is nigh, a group of vampires run a neighborhood bar and contemplate the meaning of it all as their last day on Earth ticks away.", "Telephone Tag": "After a wild night of partying, a couple's attempts to sleep off their hangovers lands them in the middle of a hostage crisis.", "Peace Out": "A high school kid (Lamont Johnson) has his life turned upside down when he is admitted to a Zen monastery, where he must do battle with a bad warlord on the bottom of a mountain and a sadistic psychologist.", "Fancy Pants": "This 1992 film stars comedian Robin Williams as the voice of a cartoon penguin of similar size and demeanor to the comedian's real life persona.", "The Unknown": "A wandering sea captain (Jack Palance) on a quest for the fountain of youth finds himself on Antartica in search of the elixir of life and a woman to share it with. You'll never find out what happens!", "Miniature Dollhouse": "This hilarious short tells the story of a small town dollhouse maker (Michael Clarke Duncan) who has been hired by the U.S. government to build an exact miniature version of the White House.", "Shopping Addict": "In this cute short, a man is advised to take a day off from the mall to spend time with his girlfriend. His advice? \"Eat, eat and eat some more!\"", "Dream Catcher": "A little girl and her pet cat travel to a mysterious land in search of Papa, a lost circus ringmaster. The little girl befriends a dragonfly that can talk, \"dream catching\" a reflection of her pet, and learns to fly all on her own.", "The Greeter": "In 1998, an international team of MIT students were chosen to receive a grant by NASA to create a manned flight simulator in microgravity. In 2001, NASA invited the MIT students in to conduct a realistic test flight, only to find that the simulator was even more realistic than they had imagined.", "Cozy Night": "A mysterious stranger (Rudolph Valentino) crashes a seance and starts raving about a sinister plot to destroy ... children's movies.", "World Map": "A group of test tube babies who have never seen a map decide it's time to travel around the world. They find themselves in one of the saddest and most hopeless places possible: the Statue of Liberty. One of the most obscure films ever made, \"World Map\" is also a poignant commentary about the power of imagination and of being able to see yourself into other people's lives", "Random Wink": "Named after Princeton University's idiosyncratic and eccentric president, Woodrow Wilson once said, \"I am a brain, and the whole world is my brain.\" This is the story about how he became president.", "Holding Hands": "A group of grade school children, visiting a zoo, attempt to help the animals escape, by holding hands.", "The Voyage": "A curiosity-mongering scientist releases a series of exotic animals into the wilds of Africa that soon turn on one another and the whole world, making it their mission to destroy humanity.", "Apple and Oranges": "This film, set in the ancient Roman Empire, stars Burt Lancaster and Laurence Olivier. At a time before the Roman Empire was really \"Roman\", they must outwit a rival tribe to possess and protect the near priceless Apple of Truth.", "Eavesdropper": "After being fired from his job as a waiter at a swanky restaurant, Bertram Kittleson gets to work on making the jukebox play his favorite songs, until the owner (Jack Benny) figures out what he is doing and forces him to perform \"The Eavesdropper's Song\" which he does, very well!"}}